app/Http/Helpers/helpers.php

function mailVerificationTemplate($user) {
    $data = [
        'user_id'       => $user->id,
        'code'          => generate_random_code(),
        'token'         => generate_unique_string("user_authorizations","token",200),
        'created_at'    => now(),
    ];

    DB::beginTransaction();
    try{
        UserAuthorization::where("user_id",$user->id)->delete();
---
delete from `user_authorizations` where `user_id` = 17

function get_user_notifications()
{
    $notifications = UserNotification::auth()->latest('id')->take(4)->get();
---
select * from `user_notifications` where `user_id` = 17 order by `id` desc limit 4