app/Http/Controllers/Api/V1/User/Auth/LoginController.php

    public function login(Request $request)
    {
        // dd($request->all());
        $this->request_data = $request;

        $validator = Validator::make($request->all(),[
            'username'   => 'required|string',
            'password'      => 'required|string',
        ]);

        if($validator->fails()) {
            return Response::error($validator->errors()->all(),[]);
        }

        $validated = $validator->validate();
        if(!User::where($this->username(),$validated['username'])->exists()) {
            return Response::error([__('User doesn\'t exists!')],[],404);
        }

        $user = User::where($this->username(),$validated['username'])->first();
---
select exists(select * from `users` where `username` = 'patrick2') as `exists`
select * from `users` where `username` = 'patrick2' limit 1

    protected function authenticated(Request $request, $user, $token)
    {
        $basic_settings     = BasicSettings::first();
        $user->update([
            'two_factor_verified'   => false,
        ]);

        try{
            $this->refreshUserWallets($user);
        }catch(Exception $e) {
            return Response::error([__('Login Failed! Failed to refresh wallet! Please try again')],[],500);
        }
        $this->createLoginLog($user);

        if($basic_settings->email_verification == true && $user->email_verified == false){
            $auth_token  = generate_unique_string("user_authorizations","token",200);
            $data = [
                'user_id'       => $user->id,
                'code'          => generate_random_code(),
                'token'         => $auth_token,
                'created_at'    => now(),
            ];

            DB::beginTransaction();
            try{
                UserAuthorization::where("user_id",$user->id)->delete();
---
select * from `basic_settings` limit 1
delete from `user_authorizations` where `user_id` = 18