app/Http/Controllers/User/Auth/RegisterController.php

    protected function create(array $data)
    {
        return User::create($data);
---
insert into `users` (`account_type`, `firstname`, `lastname`, `email`, `password`, `email_verified`, `sms_verified`, `kyc_verified`, `username`, `account_no`, `address`, `company_name`, `updated_at`, `created_at`) values ('personal', 'Obah', 'Chimaobi', 'anthonyobah37@gmail.com', '$2y$10$lsM139RhIhXi0DGc736QseKwz3deG5V9kVpAMRWwsTu/QdQJffT2e', 0, 1, 0, 'obahchimaobi', '51847425926237', '{\"country\":\"Nigeria\"}', '', '2025-09-11 15:09:19', '2025-09-11 15:09:19')