app/Traits/User/RegisteredUsers.php

    protected function createUserWallets($user) {
        $currencies = Currency::active()->roleHasOne()->pluck("id")->toArray();
        $wallets = [];
        foreach($currencies as $currency_id) {
            $wallets[] = [
                'user_id'       => $user->id,
                'currency_id'   => $currency_id,
                'balance'       => 0,
                'status'        => true,
                'created_at'    => now(),
            ];
        }

        try{
            UserWallet::insert($wallets);
---
insert into `user_wallets` (`balance`, `created_at`, `currency_id`, `status`, `user_id`) values (0, '2025-09-11 15:09:19', 1, 1, 17)